; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image5 - mode
	infrared3 - mode
	infrared2 - mode
	image6 - mode
	thermograph4 - mode
	infrared1 - mode
	infrared7 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	GroundStation4 - direction
	Star3 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared7)
	(supports instrument0 image5)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared2)
	(supports instrument1 image6)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
)
(:goal (and
	(have_image Phenomenon6 thermograph4)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 image6)
	(have_image Phenomenon8 infrared2)
	(have_image Phenomenon9 image6)
	(have_image Phenomenon9 infrared3)
	(have_image Star10 infrared3)
	(have_image Star10 image6)
	(have_image Planet11 thermograph0)
	(have_image Planet11 infrared1)
	(have_image Star12 image5)
	(have_image Star12 infrared2)
))

)

; plan
1. (turn_to satellite0 star3 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star3)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star12)
   goals met: 0 of 12
5. (take_image satellite0 star12 instrument1 infrared2)
   added: (have_image star12 infrared2)
   goals met: 1 of 12
6. (turn_to satellite0 star10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star10)
   goals met: 1 of 12
7. (take_image satellite0 star10 instrument1 infrared3)
   added: (have_image star10 infrared3)
   goals met: 2 of 12
8. (take_image satellite0 star10 instrument1 image6)
   added: (have_image star10 image6)
   goals met: 3 of 12
9. (turn_to satellite0 phenomenon9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 4 of 12
11. (take_image satellite0 phenomenon9 instrument1 image6)
   added: (have_image phenomenon9 image6)
   goals met: 5 of 12
12. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 12
13. (take_image satellite0 phenomenon6 instrument1 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 6 of 12
14. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 12
15. (take_image satellite0 phenomenon8 instrument1 image6)
   added: (have_image phenomenon8 image6)
   goals met: 7 of 12
16. (take_image satellite0 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 8 of 12
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 12
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 8 of 12
19. (turn_to satellite0 groundstation4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation4)
   goals met: 8 of 12
20. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 8 of 12
21. (turn_to satellite0 planet11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet11)
   goals met: 8 of 12
22. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 9 of 12
23. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 10 of 12
24. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 10 of 12
25. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 11 of 12
26. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 11 of 12
27. (take_image satellite0 star12 instrument0 image5)
   added: (have_image star12 image5)
   goals met: 12 of 12
